/*

Сформировалось базовое понимание работы с БД. Повторил и закрепил для чего нужна нормализация таблиц, попрактиковался в выделении отношения таблиц (один к одному, один ко многим, многие ко многим). Сейчас набор изученных операций выглядит достаточно понятным. Практика закрепила базовое понимание операций с БД:


- Создавать базы данных (CREATE DATABASE) и таблицы в них (CREATE TABLE).
- Вносить новые записи (INSERT INTO),
- Обновлять данные (UPDATE) и удалять ненужные записи (DELETE).
- Получать данные (SELECT FROM) совместно с другими операциями выборки, включая сортировку (ORDER BY), фильтрацию (WHERE), группировку (GROUP BY) и агрегатные функции (SUM, AVG и другие).
- Вносить изменения в структуру таблиц (ALTER TABLE), устанавливать первичные и внешние ключи.
- Создавать столбцы с уникальными (UNIQUE), автоинкрементируемыми значениями (IDENTITY) и индексировать таблицы (CREATE INDEX) для ускорения работы с ними.

Также в 17 занятии познакомился с хранимыми процедурами - узнал для чего они, как их выполнить и как посмотреть результат. Получил общее представление о том как эти возможности могут быть использованы для аналитики и формирования отчётов.

*/